import { CommonModule, isPlatformBrowser } from '@angular/common';
import { Component, Inject, OnInit, PLATFORM_ID } from '@angular/core';
import { ApiServiceService } from '../../../services/api-service.service';
import { NgxExtendedPdfViewerModule } from 'ngx-extended-pdf-viewer';
import { Router } from '@angular/router';
import { FormsModule } from '@angular/forms';
import { NgxPrintDirective } from 'ngx-print';
import { SocialLinksComponent } from '../../social-links/social-links.component';
import { HttpClient } from '@angular/common/http';

@Component({
  selector: 'app-iranianstudies-static',
  standalone: true,
  imports: [
    CommonModule,
    NgxExtendedPdfViewerModule,
    FormsModule,
    NgxPrintDirective,
    SocialLinksComponent,
  ],
  templateUrl: './iranianstudies-static.component.html',
  styleUrl: './iranianstudies-static.component.css',
})
export class IranianstudiesStaticComponent implements OnInit {
  constructor(
    private apiService: ApiServiceService,
    private router: Router,
    @Inject(PLATFORM_ID) private platformId: Object,
    private http: HttpClient,
  ) {}

  htmlText = `<h1 dir="rtl" style="text-align: center;">تقديم</h1>

<p dir="rtl" style="text-align: justify;">&#160;</p>

<p dir="rtl" style="text-align: justify;">يُقدم مركز المسبار للدراسات والبحوث في كتابه «إيران ما بعد «7 أكتوبر»: الممرات والحرس ومجتبى» (الكتاب السابع عشر بعد المئتين، يناير (كانون الثاني) 2025) قراءة لسيناريوهات مستقبل إيران، في ظلّ التحولات الجيوسياسية، والداخلية، والخارجية؛ فيركز على الدور الإيراني في توظيف «عملية 7 أكتوبر»؛ ويحدد تأثيراتها الداخلية والخارجية، متناولاً مشروع «الممر الاقتصادي بين الهند والشرق الأوسط وأوروبا»، والممرات الاقتصادية الإقليمية الأخرى، وأثر العملية على ترتيب الحكم في إيران، وبناء التفاوض مع الإدارة الأميركية الجديدة.</p>

<p dir="rtl" style="text-align: justify;">فاتحة دراسات الكتاب قدمها الباحث المصري في الشؤون الإيرانية محمد محسن أبو النور، تطرق فيها إلى العوامل التأسيسية التي بلورت نفوذ طهران في المنطقة منذ عام 1979، عبر توظيف خطاب «المظلومية الطائفية». يوضح الباحث طبيعة الاستراتيجية الجيوسياسية الإيرانية وأدوات قوتها الصلبة (كالحرس الثوري والأذرع العسكرية) والناعمة (الدبلوماسية والثقافة والإعلام) التي سعت عبرها لحجز مكانة إقليمية، ويحاول توقّع الكيفية التي ستمتص بها طهران هزيمة محاورها المدوّية؛ فتتخلى عن جميع أوراقها للإبقاء على الورقة النووية، عبر استراتيجية الكمون النووي، الذي وصفه الباحث بـ«الاستراتيجية اليابانية».</p>

<p dir="rtl" style="text-align: justify;">ترصد دراسة الباحث الإيراني سيروس أحمدي نوحداني المنافسة الجيوسياسية المتصاعدة في الإقليم، عبر تأسيس ممرات بديلة لطريق الحرير، وصفها بالمستحدثة التي تستثني إيران، مثل «الممر الاقتصادي بين الهند والشرق الأوسط وأوروبا» والذي قرأه على أنه يُعدّ محاولة لتهميش الدور الإيراني، لذا دعمت طهران كل ما يعرقله. من جهته يعرض أستاذ العلوم السياسية في جامعة طهران نوذر شفيعي، موقف إيران من تدشين «ممر زنجزور» بين أذربيجان وتركيا، وهو المشروع الذي تعتبره طهران تهديدًا استراتيجيًّا لمصالحها شمالًا. ويربط هذا الموقف بتوتر العلاقات الإيرانية-الأذربيجانية، مشيرًا إلى أن الحرب الثانية في إقليم قره باغ (2020) مثّلت نقطة تحوّل كبرى في جنوب القوقاز صبّت في صالح تمدد النفوذ التركي-الأذربيجاني على حساب الدور الإيراني التقليدي. فمشروع ممر زنجزور المدعوم من باكو وأنقرة يهدف إلى ربط أذربيجان مباشرةً بتركيا عبر الأراضي الأرمينية، ملتفًّا حول إيران ومهددًا بقطع خطوط التواصل بينها وبين أرمينيا؛ إذ تخشى إيران من نزعات «الوحدة التركية» بين أذربيجان وتركيا وتأثيرها في الأقلية الأذرية الكبيرة في الداخل الإيراني؛ في ظل التحولات والانتقالات المزمعة في الداخل الإيراني.</p>

<p dir="rtl" style="text-align: justify;">يتناول الباحث الإيراني عبدالكريم روستامي الموقع المحتمل للحرس الثوري في مستقبل النظام الإيراني، ودوره في التحديات المحتملة التي سيواجهها في ترتيبات خلافة المرشد، والخيارات التي قد يتبنّاها لضمان استمرار نفوذه. فيدرس حدود نفوذ السيد مجتبى خامنئي، ومحمد مهدي ميرباقري، وعلي أصغر حجازي، في المستقبل. ويبحث انعكاسات نفوذ الحرس على سياسة إيران الخارجية، مؤكدًا أن دوره الخارجي (عبر فيلق القدس ودعم الحلفاء الإقليميين) سيظل ورقة قوة بيد المؤسسة حتى في ظل أي تغيير داخلي.</p>

<p dir="rtl" style="text-align: justify;">ركّز الباحث الإيراني في العلاقات الدولية حسين علي زادة، على دراسة ملامح شخصية مجتبى خامنئي واحتمالات خلافته والده. وبعد مقارنات يشير إلى أنّ السيد مجتبى راكم نفوذًا مؤثرًا داخل دوائر صنع القرار الأمني والسياسي في إيران؛ وهو الذي يُوصف بأنه «ظلّ أبيه» والمنفّذ الأمين لسياسات المرشد، حيث أشرف من وراء الستار على ملفات حسّاسة، منها المساهمة في كتيبة خاصة تُعرف بـ«كتيبة حبيب» التي تُعدّ بمثابة غرفة عمليات وفكر تدين بالولاء لمجتبى، وتعمل على تعزيز حضوره، حسب زعم الكاتب.</p>

<p dir="rtl" style="text-align: justify;">بينما تُسلّط الباحثة الإيرانية منى سيلاوي الضوء على دور المصاهرات السياسية في إيران وتأثيرها في صناعة القرار والمستقبل؛ سواء بالتركيز على المصاهرات الداخلية أو الزيجات العابرة للحدود، حيث يرتبط أفراد من النخبة الإيرانية بعائلات ذات امتدادات أسرية في دول أخرى؛ سعيًا وراء توسيع النفوذ أو تحقيق مكاسب سياسية واقتصادية. زاعمةً أن هذه المصاهرات السياسية ولّدت طبقة حاكمة شبه وراثية في إيران، لها مصالح مشتركة ومتداخلة.</p>

<p dir="rtl" style="text-align: justify;">قدّمت الباحثة والأكاديمية الإيرانية شبنم دادبرور لدور الحوزة الدينية الشيعية في السياسة الإيرانية ومستقبلها المحتمل، فتعود إلى ثورة 1979؛ لتبرز الدور المحوري الذي لعبته الحوزات العلمية ومرجعياتها في إسقاط نظام الشاه وتأسيس نظام ولاية الفقيه. ثم تستعرض موقع الحوزة خلال عهد الخميني، حين تبوأ رجال الدين قمة السلطة، لكن ظلّت الحوزات في قم والنجف تحت رقابة القيادة السياسية. بقيت الحوزة بوصفها مؤسسة محافظة على قدر من الاستقلالية التقليدية، وبرزت أحيانًا تباينات خفية بين بعض المراجع الدينيين والسلطة السياسية؛ ولكن نفوذها تراجع مقارنة بالحرس الثوري. تشير الباحثة إلى أنّ خلافة المرشد سوف تحدد إن كان مصير الحوزة سوف ينتعش، أم يذوي مع سيادة المؤسسة الأمنية العسكرية.</p>

<p dir="rtl" style="text-align: justify;">تنقلنا الباحثة الإيرانية سعيدة تراب بدراستها إلى البعد الاجتماعي، عبر بحث دور المرأة في مستقبل إيران السياسي، واضعةً تصورات لمرحلة «الولي الفقيه الثالث» بعد خامنئي. تبدأ الدراسة بعرض تاريخي موجز عن وضع المرأة وحقوقها، بالمقارنة بين عهد الشاه محمد رضا بهلوي، الذي منح النساء بعض الحقوق والمكتسبات الاجتماعية، وبين حقبة الجمهورية الإسلامية التي شهدت تقييدًا كبيرًا لدور المرأة. ثم تتناول التعقيدات المرتبطة بقضية الحجاب في إيران بوصفها رمزًا احتجاجيًا يعكس صراعًا اجتماعيًّا وسياسيًّا أكثر منه دينيًّا. ترى الباحثة أن نضال الإيرانيات من أجل المساواة لن يتوقف بمجرد تغيير رأس الهرم، بل هو مسار طويل سوف يعتمد على مدى قدرة المجتمع المدني والقوى الإصلاحية على فرض واقع جديد يتجاوز العقليات الأبوية الراسخة.</p>

<p dir="rtl" style="text-align: justify;">وفي جدل المستقبل يُحدّد الباحث عارف نصر مستقبل الشعوب غير الفارسية في حال دخولها مرحلة ما بعد خامنئي وتغيّر النظام، فيبدأ برسم خريطة التنوع القومي والديني في إيران، مشيرًا إلى المكونات الرئيسة فيها من الأذريين والأكراد والعرب الأحوازيين والبلوش والتركمان واللور وغيرهم، فكل منها يحمل إرثًا من التهميش ولديه مطالب تاريخية بالحقوق الثقافية والسياسية. ثم يرصد الباحث التحديات التي واجهتها إيران في إدارتها لهذا التنوع، بما في ذلك تبعات سياسات القمع أو الاستيعاب، واستخدام خطاب «المظلومية» من قبل بعض تلك الجماعات لحشد التأييد لقضاياها.</p>

<p dir="rtl" style="text-align: justify;">على الرغم من طرح الباحث هذه السيناريوهات الجريئة، فإنه يشدد على ضرورة تعامل الشعوب غير الفارسية بحذر وواقعية. فهو يحذّر من الانجرار وراء وعود الدعم الخارجي التي قد تجعل تلك الجماعات أداةً بيد قوى أجنبية أكثر منها جماعات تطالب بحقوقها. ويدعو إلى بناء حركات داخلية قوية ومستقلة، تستفيد من ضعف المركز دون الوقوع في فخ التبعية. في المحصلة، تبرز الدراسة أن مسألة القوميات تشكل عاملًا حاسمًا في مستقبل إيران؛ فطريقة استجابة النظام لطموحاتها، وكيفية إدارة تلك الشعوب لتحركاتها، ستحدّدان -إلى حد بعيد- وحدة البلاد أو اتجاهها نحو مشاريع انفصالية، قد تعيد رسم خريطة إيران والإقليم بأسره.</p>

<p dir="rtl" style="text-align: justify;">تطرقت الباحثة والأكاديمية ويدا ياقوتي إلى وضع الاقتصاد الإيراني وتعرضه لضغط العقوبات الأميركية والأزمات الجيوسياسية الإقليمية. وتستهل دراستها بمدخل نظري يشرح مفهوم الاقتصاد السياسي، وكيفية تفاعل العوامل الاقتصادية والسياسية معًا. ثم تنتقل إلى تحليل العقوبات الأميركية المفروضة على إيران وأهداف واشنطن المعلَنة (ككبح البرنامج النووي وتغيير سلوك النظام) وأدواتها (من حظر الصادرات النفطية إلى فصل إيران عن النظام المالي العالمي)، إضافةً إلى ما خلّفته هذه العقوبات من آثار خطرة على الاقتصاد الإيراني. توضح الباحثة أن العقوبات أدّت إلى تغييرات هيكلية داخل الاقتصاد الإيراني؛ فقد دفعت طهران إلى محاولة تعزيز الإيرادات غير النفطية عبر إصلاحات في النظام الضريبي، وأجبرتها على تقليص الاعتماد على الواردات وتشجيع الإنتاج المحلي.</p>

<p dir="rtl" style="text-align: justify;">بينما تستشرف دراسة الباحث أمين برتو العلاقات الإيرانية-الأميركية، بعد فوز دونالد ترمب بولاية رئاسية ثانية (2025–2029)، والتي تعد «التحدي الأصعب» لصنّاع القرار في طهران على صعيد السياسة الخارجية؛ إذ يواجهون إدارة أميركية أكثر تشددًا واندفاعًا حيال إيران. يستعرض الباحث سجلّ ترمب خلال ولايته الأولى (2017–2021) الذي تميّز بـ«لغز» في النهج؛ فقد انسحب من الاتفاق النووي وفرض حملة «الضغط الأقصى»، لكنه أيضًا أعرب أحيانًا عن رغبته في إبرام صفقة شاملة جديدة مع إيران. هذا التناقض يجعل توقّع سلوك ترمب في ولايته الثانية أمرًا بالغ الصعوبة لإيران.</p>

<p dir="rtl" style="text-align: justify;">في الختام، يتوجه مركز المسبار للدراسات والبحوث بالشكر للباحثين المشاركين في الكتاب والعاملين على خروجه للنور، ويخصّ بالذكر محمد محسن أبو النور، منسق العدد، ونأمل أنْ يسد ثغرة في المكتبة العربية.</p>

<p dir="rtl" style="text-align: justify;">&#160;</p>

<p dir="rtl" style="text-align: left;">رئيس التحرير</p>

<p dir="rtl" style="text-align: left;">عمر البشير الترابي</p>

<p dir="rtl" style="text-align: left;">يناير (كانون الثاني) 2025</p>`;
  fontSize = 28;
  selectedItem = 'YourCustomFontName2';
  pdfURL: any;
  studies_in_tolerance: any[] = [];
  title: any;
  items = [
    { label: 'الخط 1', value: 'YourCustomFontName2' },
    {
      label: 'الخط 2',
      value: 'Noto Kufi Arabic,ui-sans-serif,Helvetica Neue,sans-serif',
    },

    {
      label: 'الخط 3',
      value: 'Tajawal',
    },
    {
      label: 'الخط 4',
      value: 'Amiri Quran',
    },
  ];

  ngOnInit(): void {
    this.pdfURL = this.apiService.getPdfProxyUrl(
      'https://www.almesbar.net/assets/bhm/mb/TOC/217.pdf',
    );

    this.title = this.apiService.getArabicName('iranianstudies');
    this.get();
  }

  gotoDetail(slide: any) {
    this.router.navigate(['/iranianstudies/' + slide._id]);
  }

  gotoDetail2() {
    this.router.navigate(['/iranianstudies']);
  }

  get() {
    this.apiService.get_all('iranianstudies').subscribe(
      (data: any) => {
        // if (Array.isArray(data.data)) {
        this.studies_in_tolerance = data.data;
        // } else {
        //   this.studies_in_tolerance = [];
        // }
      },
      (error) => {
        this.studies_in_tolerance = [];
      },
    );
  }

  changeFontSize(action: 'smaller' | 'bigger') {
    if (action === 'smaller' && this.fontSize > 10) {
      this.fontSize -= 2;
    } else if (action === 'bigger' && this.fontSize < 40) {
      this.fontSize += 2;
    }
  }

  getUrl(): string {
    return isPlatformBrowser(this.platformId) ? window.location.href : '';
  }
  loadingMap: { [key: string]: boolean } = {};

  downloadPdf(url: any) {
    if (!isPlatformBrowser(this.platformId)) {
      return;
    }

    const encodedUrl = this.apiService.downloadPdf(url);
    this.loadingMap[url] = true;

    this.http.get(encodedUrl, { responseType: 'blob' }).subscribe({
      next: (blob) => {
        const fileURL = window.URL.createObjectURL(blob);

        const a = document.createElement('a');
        a.href = fileURL;
        a.download = url.split('/').pop() || 'file.pdf';
        a.click();

        window.URL.revokeObjectURL(fileURL);

        this.loadingMap[url] = false;
      },
      error: () => {
        this.loadingMap[url] = false;
      },
    });
  }
}
